cf_billing/Enums/энргВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьэнргПерерасчет_КорректировкаПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_ВосстановлениеИзЗабалансаФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_СписаниеНаЗабалансФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ИзменениеКатегорииЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ОтменаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_РегистрацияЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_РегистрацияПоСтроению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_РегистрацияПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_СнятиеРегистрацииПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ЗакрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ОткрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_СменаСобственника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ОтключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ПодключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Закрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Открытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ВозвратСредствПотребителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_НеправильноРаспределеннаяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ПереносМеждуЛицевымиСчетами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_БлокировочныйАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаПотребленногоОбъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияПоказанийАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеЗабалансовойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеНаЗабаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_СвязанныеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Извещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_ПередачаПакетаДокументовЮристам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РегистрацияИсполнительногоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РешениеСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ЗакрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОтключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОткрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ПодключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПерерасчетНенадлежащегоКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ОбщаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ИндивидуальнаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ОтключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПереносВозвратОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_МассовоеСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_ЗагрузкаПоказанийИзВнешнихИсточников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОграничениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ВозобновлениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Подключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Вмешательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_КорректировкаПениПоСудебномуРешению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_РучнаяКорректировкаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_РегистрацияПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_АннулированиеПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РаспределениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ЗагрузкаРеестраЕИРЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ИсключениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ВозобновлениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_ПериодОтсутствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_КорректировкаПериодаОтсутствия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonForms/энргФормаВыбораОперации/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Параметры.ЗначенияЗаполнения);	
	ВыборОперации 							= Параметры.ВыборОперации;	
	Если ВыборОперации тогда 
		энргРаботаСВидамиОперацийСервер.ЗаполнитьСписокВозможныхОперацийФормаСписка(Параметры.ИмяДокумента,СписокОпераций);
		ИмяДокумента 						= Параметры.ИмяДокумента;
		Основание 							= Параметры.Основание;
		ЭтаФорма.Заголовок 					= "Выбор вида операции";
	иначе
		СписокОпераций 						= Параметры.ВозможныеЗначения;
		ЭтаФорма.Заголовок 					= "Тип выбираемого объекта";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Если  ТекущийЭлемент.ТекущаяСтрока<>0 тогда
	//	текущаяСтрока =   ТекущийЭлемент.ТекущаяСтрока-1;
	//иначе 
		текущаяСтрока = ТекущийЭлемент.ТекущаяСтрока;
	//КонецЕсли;
	ВыбранноеЗначение  	= СписокОпераций[текущаяСтрока].Значение;
	Если ВыборОперации тогда
		ПрефиксФормы 		= энргРаботаСВидамиОперацийВызовСервера.ПрефиксФормы(ИмяДокумента,ВыбранноеЗначение);
		Парам = Новый Структура;
		Парам.Вставить("Основание",Основание);
		
		Если ЗначениеЗаполнено(Абонент) Тогда
			СтруктураЗаполнения = Новый Структура;
			Если Не ПрефиксФормы = "ОткрытиеЛС" Тогда  
				СтруктураЗаполнения.Вставить("Абонент", Абонент);
			КонецЕсли;
			Соответствие = Новый Соответствие;
			Соответствие.Вставить("КлючПомещения");
			Соответствие.Вставить("Район");
			Соответствие.Вставить("Организация");
			энргОбщегоНазначения.ПолучитьЗначенияРеквизитов(, Абонент, Соответствие);
			
			СтруктураЗаполнения.Вставить("КлючПомещения", Соответствие["КлючПомещения"]);
			СтруктураЗаполнения.Вставить("Район", Соответствие["Район"]);
			СтруктураЗаполнения.Вставить("Организация", Соответствие["Организация"]);
			Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_ИзменениеПараметраРассчета") Или ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргПерерасчет_КорректировкаОплаты") Тогда
				СтруктураПомещения		= Новый Структура("КлючПомещения, Абонент", Соответствие["КлючПомещения"], Абонент);
				Помещения				= Новый Массив;
				Помещения.Добавить(СтруктураПомещения);
				СтруктураЗаполнения.Вставить("Помещения", Помещения);
			КонецЕсли;
			Парам.Вставить("ЗначенияЗаполнения", СтруктураЗаполнения);
			Парам.Вставить("ЗаполнитьДокумент", Истина);
		ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.энргВидыОпераций.энргОперацияСТочкамиПоставки_ОтключениеТочкиПоставки") Тогда
			СтруктураЗаполнения = Новый Структура;
			СтруктураЗаполнения.Вставить("ДопЗначенияЗаполнения", ДопЗначенияЗаполнения);
			Парам.Вставить("ЗначенияЗаполнения", СтруктураЗаполнения);
			Парам.Вставить("ЗаполнитьДокумент", Истина);
		КонецЕсли;
		энргРаботаСВидамиОперацийКлиент.ОткрытьФормуНовогоДокументаПоВидуОперации(ИмяДокумента, ВыбранноеЗначение, ПрефиксФормы, Парам);
		ЭтаФорма.Закрыть();
	иначе
		ОповеститьОВыборе(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры


// Стандартная не работает, заменил временно на это!
&НаКлиенте
Процедура Выбрать(Команда)
	
	СписокОперацийВыбор(Элементы.СписокОпераций,  ТекущийЭлемент.ТекущаяСтрока, Элементы.СписокОпераций.ТекущийЭлемент, Истина);
КонецПроцедуры




#КонецОбласти
